; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem blocksworld-70)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 - object)
 (:init 
    (arm-empty)
    (clear b13)
    (on b13 b21)
    (on b21 b4)
    (on b4 b10)
    (on b10 b3)
    (on b3 b11)
    (on b11 b20)
    (on b20 b9)
    (on b9 b8)
    (on b8 b16)
    (on b16 b15)
    (on b15 b6)
    (on b6 b5)
    (on b5 b19)
    (on b19 b17)
    (on b17 b18)
    (on b18 b1)
    (on b1 b2)
    (on b2 b12)
    (on b12 b14)
    (on-table b14)
    (clear b7)
    (on-table b7))
 (:goal (and 
(on-table b14)
(on b21 b13)
))
)

; plan
1. (unstack b13 b21)
   deleted: (on b13 b21) (clear b13) (arm-empty)
   added: (holding b13) (clear b21)
   goals met: 1 of 2
2. (putdown b13)
   deleted: (holding b13)
   added: (clear b13) (arm-empty) (on-table b13)
   goals met: 1 of 2
3. (unstack b21 b4)
   deleted: (on b21 b4) (clear b21) (arm-empty)
   added: (holding b21) (clear b4)
   goals met: 1 of 2
4. (stack b21 b13)
   deleted: (clear b13) (holding b21)
   added: (arm-empty) (clear b21) (on b21 b13)
   goals met: 2 of 2
